---
type: RebarBendingDetailType
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 27
tags: [revit-api, class]
---

# RebarBendingDetailType

`Autodesk.Revit.DB.Structure.RebarBendingDetailType` · Revit 2024 · 27 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2024 | `public static RebarBendingDetailType Create ( Document Document )` |
| Property | AngularDimensionTextPosition | 2024 | `public BendingDetailDimensionTextPosition AngularDimensionTextPosition { get ; set ; }` |
| Property | AngularDimensionTypeId | 2024 | `public ElementId AngularDimensionTypeId { get ; set ; }` |
| Property | AngularDimensionsDisplayOption | 2024 | `public BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption { get ; set ; }` |
| Property | AngularDimensionsEnabled | 2024 | `public bool AngularDimensionsEnabled { get ; set ; }` |
| Property | AngularDimensionsForHooksEnabled | 2024 | `public bool AngularDimensionsForHooksEnabled { get ; set ; }` |
| Property | AngularDimensionsMeasurementOptions | 2024 | `public BendingDetailAngularDimensionsMeasurementOptions AngularDimensionsMeasurementOptions { get ; set ; }` |
| Property | AngularDimensionsOffset | 2024 | `public double AngularDimensionsOffset { get ; set ; }` |
| Property | BendDiameterDimensionType | 2024 | `public BendingDetailBendDiameterDimensionType BendDiameterDimensionType { get ; set ; }` |
| Property | BendDiameterDimensionsEnabled | 2024 | `public bool BendDiameterDimensionsEnabled { get ; set ; }` |
| Property | BendDiameterDimensionsForHooksEnabled | 2024 | `public bool BendDiameterDimensionsForHooksEnabled { get ; set ; }` |
| Property | BendDiameterDimensionsForSegmentsEnabled | 2024 | `public bool BendDiameterDimensionsForSegmentsEnabled { get ; set ; }` |
| Property | DetailLevel | 2024 | `public BendingDetailLevelOfDetail DetailLevel { get ; set ; }` |
| Property | DiameterDimensionTypeId | 2024 | `public ElementId DiameterDimensionTypeId { get ; set ; }` |
| Property | MultipleValuesIndicatorOption | 2024 | `public BendingDetailTypeMultipleValuesIndicatorOptions MultipleValuesIndicatorOption { get ; set ; }` |
| Property | OrthogonalAndOverallDimesionsEnabled | 2024 | `public bool OrthogonalAndOverallDimesionsEnabled { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | RadialDimensionTypeId | 2024 | `public ElementId RadialDimensionTypeId { get ; set ; }` |
| Property | RepresentaionOf3DShapes | 2024 | `public BendingDetailFor3DShapesOptions RepresentaionOf3DShapes { get ; set ; }` |
| Property | SegmentLengthDimensionTextPosition | 2024 | `public BendingDetailDimensionTextPosition SegmentLengthDimensionTextPosition { get ; set ; }` |
| Property | SegmentLengthDimensionTypeId | 2024 | `public ElementId SegmentLengthDimensionTypeId { get ; set ; }` |
| Property | SegmentLengthDimensionsEnabled | 2024 | `public bool SegmentLengthDimensionsEnabled { get ; set ; }` |
| Property | SegmentLengthDimensionsForHooksEnabled | 2024 | `public bool SegmentLengthDimensionsForHooksEnabled { get ; set ; }` |
| Property | SegmentLengthDimensionsOffset | 2024 | `public double SegmentLengthDimensionsOffset { get ; set ; }` |
| Property | SegmentLengthsDisplayOption | 2024 | `public BendingDetailSegmentLengthsDisplayOptions SegmentLengthsDisplayOption { get ; set ; }` |
| Property | SegmentLengthsForArcsDisplayOption | 2024 | `public BendingDetailSegmentLengthsDisplayOptions SegmentLengthsForArcsDisplayOption { get ; set ; }` |
| Property | SegmentsRepresentation | 2024 | `public BendingDetailSegmentsRepresentation SegmentsRepresentation { get ; set ; }` |